HarryVienna/ESP32-Weather-Station-and-Air-Quality-Monitor/Sensor-LORA-RadiationD/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32s3"

# No reboot after panic
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# 80 MHz is sufficient for I2C/SPI/ADC — saves ~40 mA vs 240 MHz during active phase
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=80

# Dynamic Frequency Scaling: scale down to XTAL (40 MHz) when idle.
# No light sleep — would break the geiger counter's GPIO pulse interrupt.
CONFIG_PM_ENABLE=y

# Flash size (detected 8 MB)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8mb"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ADC Calibration: ESP32-S3 uses curve fitting
CONFIG_ADC_CALI_CURVE_FITTING_ENABLE=y

# ULP-FSM für Geiger-Impulszählung im Deep Sleep
CONFIG_ULP_COPROC_ENABLED=y
CONFIG_ULP_COPROC_TYPE_FSM=y
CONFIG_ULP_COPROC_RESERVE_MEM=512

# Primäre Console auf USB Serial/JTAG (idf.py monitor)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Skip firmware SHA256 validation on deep-sleep wake
CONFIG_BOOTLOADER_SKIP_VALIDATE_ALWAYS=y

CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_BOOTLOADER_LOG_LEVEL=0
#CONFIG_BOOT_ROM_LOG_ALWAYS_OFF=y

CONFIG_FREERTOS_UNICORE=y
CONFIG_FREERTOS_HZ=1000

#CONFIG_LOG_DEFAULT_LEVEL_NONE=y
#CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
